import { FirstFoodIcon, SecondFoodIcon } from '~/shared/custom-icons';

export const VEGAN_HEADINGS = [
    {
        id: 1,
        title: 'Стейк для вегетарианцев',
        icon: <SecondFoodIcon boxSize='24px' />,
    },
    {
        id: 2,
        title: 'Котлеты из гречки и фасоли',
        icon: <SecondFoodIcon boxSize='24px' />,
    },
    {
        id: 3,
        title: 'Сырный суп с лапшой и брокколи',
        icon: <FirstFoodIcon boxSize='24px' />,
    },
];

export const VEGAN_HIGHLIGHTS = [
    {
        id: 1,
        title: 'Картошка, тушенная с болгарским перцем и фасолью в томатном соусе',
        desc: 'Картошка, тушенная с болгарским перцем, фасолью, морковью и луком, -  вариант сытного блюда на каждый день. Фасоль в данном случае заменяет мясо, делая рагу сытным и питательным. Чтобы сократить время  приготовления, возьмём консервированную фасоль. Блюдо хоть и простое, но в полной мере наполнено ароматами и имеет выразительный вкус за счёт  добавления томатной пасты.',
        tag: {
            icon: './svg/dish-second.svg',
            name: 'Вторые блюда',
        },
        bookmark: 1,
        likes: 1,
    },
    {
        id: 2,
        title: 'Капустные котлеты',
        desc: 'Капустные котлеты по этому рецепту получаются необычайно пышными и  невероятно вкусными. Мягкий вкус и лёгкая пряная нотка наверняка помогут сделать эти чудесные котлеты из капусты одним из ваших любимых овощных  блюд.',
        tag: {
            icon: './svg/dish-second.svg',
            name: 'Вторые блюда',
        },
        bookmark: 2,
        likes: 1,
    },
];

export const JUICY_LIST = [
    {
        id: 1,
        title: 'Лапша с курицей и шафраном',
        desc: 'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        img: './img/juiciest-page/1.jpg',
        tag: {
            icon: './svg/dish-second.svg',
            name: 'Вторые блюда',
        },
        bookmark: 258,
        likes: 342,
    },
    {
        id: 2,
        title: 'Том-ям с капустой кимчии',
        desc: 'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        img: './img/juiciest-page/2.jpg',
        tag: {
            icon: './svg/dish-national.svg',
            name: 'Национальные',
        },
        bookmark: 124,
        likes: 324,
    },
    {
        id: 3,
        title: 'Пряная ветчина по итальянски',
        desc: 'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        img: './img/juiciest-page/3.jpg',
        tag: {
            icon: './svg/dish-second.svg',
            name: 'Вторые блюда',
        },
        bookmark: 159,
        likes: 3257,
    },
    {
        id: 4,
        title: 'Кнели со спагетти',
        desc: 'Как раз после праздников, когда мясные продукты еще остались, но никто их уже не хочет, время варить солянку.',
        img: './img/juiciest-page/4.jpg',
        tag: {
            icon: './svg/dish-second.svg',
            name: 'Вторые блюда',
        },
        bookmark: 124,
        likes: 231,
    },
    {
        id: 5,
        title: 'Картошка, тушенная с болгарским перцем и фасолью в томатном соусе',
        desc: 'Картошка, тушенная с болгарским перцем, фасолью, морковью и луком, -  вариант сытного блюда на каждый день. Фасоль в данном случае заменяет  мясо, делая рагу сытным и питательным. Чтобы сократить время  приготовления, возьмём консервированную фасоль. Блюдо хоть и простое, но в полной мере наполнено ароматами и имеет выразительный вкус за счёт  добавления томатной пасты.',
        img: './img/juiciest-page/5.jpg',
        tag: {
            icon: './svg/dish-second.svg',
            name: 'Вторые блюда',
        },
        bookmark: 120,
        likes: 180,
    },
    {
        id: 6,
        title: 'Картофельные рулетики с грибами',
        desc: 'Рекомендую всем приготовить постное блюдо из картофеля и грибов.  Готовится это блюдо без яиц, без мяса и без сыра, из самых простых  ингредиентов, а получается очень вкусно и сытно. Постный рецепт  картофельных рулетиков с грибами, в томатном соусе, - на обед, ужин и  даже на праздничный стол!',
        img: './img/juiciest-page/5.jpg',
        tag: {
            icon: './svg/dish-child.svg',
            name: 'Детские блюда',
        },
        bookmark: 85,
        likes: 180,
    },
    {
        id: 7,
        title: 'Овощная лазанья из лаваша',
        desc: 'Большое, сытное блюдо для ценителей блюд без мяса! Такая лазанья  готовится с овощным соусом и соусом бешамель, а вместо листов для  лазаньи используется тонкий лаваш.',
        img: './img/juiciest-page/7.jpg',
        tag: {
            icon: './svg/dish-grill.svg',
            name: 'Блюда на гриле',
        },
        bookmark: 85,
        likes: 152,
    },
    {
        id: 8,
        title: 'Тефтели из булгура и чечевицы, запечённые в томатном соусе',
        desc: 'Тефтели из булгура и чечевицы – яркие и питательные, отлично подходят  для постного и вегетарианского меню. Тефтели получаются нежными, а также сочными и ароматными благодаря использованию томатного соуса и душистых пряностей.',
        img: './img/juiciest-page/8.jpg',
        tag: {
            icon: './svg/dish-second.svg',
            name: 'Вторые блюда',
        },
        bookmark: 85,
        likes: 150,
    },
];
