export const PAGE_META = {
    Home: {
        title: 'Главная',
        desc: 'Готовьте по рецептам, создавайте свои блюда, подписывайтесь на кулинаров и общайтесь на форуме. Присоединяйтесь к yee-daa!',
    },
    JuiciestCollection: {
        title: 'Самое сочное',
        desc: 'Откройте подборку самых вкусных и сочных рецептов, которые обязательно стоит попробовать!',
    },
    NotFound: {
        title: 'Страница не найдена',
        desc: 'Кажется, такой страницы нет. Возможно, ссылка устарела или была удалена.',
    },
    Auth: {
        title: 'Вход и регистрация',
        desc: 'Войдите в свою учетную запись или зарегистрируйтесь, чтобы делиться рецептами и общаться с другими кулинарами.',
    },
    Recipe: {
        title: 'Рецепт',
        desc: 'Подробный рецепт с пошаговыми инструкциями, ингредиентами и советами по приготовлению.',
    },
    NewRecipe: {
        title: 'Добавить рецепт',
        desc: 'Создайте свой уникальный рецепт, поделитесь им с сообществом и получите отзывы!',
    },
    CategoryCuisine: {
        title: 'Категории кухни',
        desc: 'Исследуйте кухни мира – от традиционных до современных рецептов.',
    },
    Blogs: {
        title: 'Кулинарные блоги',
        desc: 'Читайте статьи, истории и советы опытных кулинаров. Подпишитесь на любимых авторов!',
    },
    BloggerProfile: {
        title: 'Профиль блогера',
        desc: 'Ознакомьтесь с лучшими рецептами, публикациями и подписками вашего любимого кулинарного автора.',
    },
};
